docs/linux/some-interesting-options.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-23 Tue 23:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some interesting options</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" type="text/css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/about.html">about</a>
</div>
<div id="content">
<h1 class="title">Some interesting options</h1>

<div id="outline-container-org5a2eb6c" class="outline-2">
<h2 id="org5a2eb6c"><span class="section-number-2">1</span> Hide processes running as other users</h2>
<div class="outline-text-2" id="text-1">
<p>
The proc filesystem supports the following mount option <code>hidepid</code>
</p>

<p>
0   Everybody  may access all <i>proc</i>[pid] directories.  This is the traditional behavior, and the default if this mount option is not specified.
1   Users may not access files and subdirectories inside any <i>proc</i>[pid]  directories  but  their  own  (the <i>proc</i>[pid]  directories  themselves  remain  visible)
2   As for mode 1, but in addition the <i>proc</i>[pid] directories belonging to other  users  become  invisible.
</p>


<div class="org-src-container">
<pre class="src src-bash">mount -o remount,rw,nosuid,nodev,noexec,relatime,<span class="org-variable-name">hidepid</span>=2 /proc
</pre>
</div>

<div class="org-src-container">
<pre class="src src-/etc/fstab">proc    /proc    proc    defaults,nosuid,nodev,noexec,relatime,hidepid=2     0     0
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b4e202" class="outline-2">
<h2 id="org8b4e202"><span class="section-number-2">2</span> Disable reading kernel message buffer for unprivileged users</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-bash">sysctl -w kernel.dmesg_restrict=1
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
2021
</div>
</body>
</html>
